[
  {
    "path": "posts/2021-08-31-getting-started-with-r-rstudio/",
    "title": "1. Start with R + Git",
    "description": "The importance of reproducibility.  Ideas of computational statistics, data science, and machine learning.  Some resources for starting with R + RStudio + Git + GitHub.",
    "author": [
      {
        "name": "Jo Hardin",
        "url": "https://m154-comp-stats.netlify.app/"
      }
    ],
    "date": "2021-08-31",
    "categories": [],
    "contents": "\n\n\n\nFigure 1: Artwork by @allison_horst.\n\n\n\nAgenda \nAugust 30, 2021\nQuestionnaire\nSyllabus & Course Outline\nStitch Fix Algorithm\nCollege Rankings\nCan Twitter predict election results?\nSeptember 1, 2021\nDesign Challenge (Not So Standard Deviations)\nReproducibility & GitHub\nReadings \nThe syllabus\nModern Data Science with R Prologue\nClass notes Introduction\nReflection Questions \nEthics considerations \nWhy is it problematic if the analysis isn’t reproducible?\nIs every analysis worth doing? (e.g., time to get to work, predicting presidential results, etc.). Can the act of doing the analysis be ethically questionable?\nSlides \nhttps://github.com/hardin47/m154-comp-stats/blob/master/_posts/2021-08-31-getting-started-with-r-rstudio/someRideas.Rmd\nAdditional Resources \nGreat algorithm for the whole process\nDesign Challenge (Not So Standard Deviations)\nVideo (less than 2 min) on the strengths of reproducible research\nR vs. Python? (My personal opinion is that neither of the languages is “best”.)\n2017 Kaggle user survey and  2019 Stack Overflow Developer Survey\nPNAS paper retracted due to problems with figure and reproducibility (April 2016)\nAnalysis of Trump’s tweets with evidence that someone else tweets from his account using an iPhone part 1 and part 2 \n\n\n\n",
    "preview": "posts/2021-08-31-getting-started-with-r-rstudio/../../images/reproducibility_court.png",
    "last_modified": "2021-08-23T17:19:53-07:00",
    "input_file": {},
    "preview_width": 4678,
    "preview_height": 2814
  },
  {
    "path": "posts/2021-08-24-syllabus/",
    "title": "0. Syllabus",
    "description": "what is this class all about?",
    "author": [
      {
        "name": "Jo Hardin",
        "url": "https://m154-comp-stats.netlify.app/"
      }
    ],
    "date": "2021-08-24",
    "categories": [],
    "contents": "\nComputational Statistics\nMath 154, Fall 2021\nJo Hardin 2351 Estella jo.hardin@pomona.edu\nOffice Hours: TBA, or by appointment\nMentor Sessions:\nTBA\nEstella 1021 (Emmy Noether Room)\n\n\n\nFigure 1: Artwork by @allison_horst.\n\n\n\nThe course\nComputational Statistics will be an introduction to statistical methods that rely heavily on the use of computers. The course will generally have three parts. The first section will include communicating and working with data in a modern era. This includes data wrangling, data visualization, data ethics, and collaborative research (via GitHub). The second part of the course will focus on traditional statistical inference done through computational methods (e.g., permutation tests and bootstrapping). The last part of the course will focus on machine learning ideas such as classification, clustering, and dimension reduction techniques. Some of the methods were invented before the ubiquitous use of personal computers, but only because the calculus used to solve the problem was relatively straightforward (or because the method wasn’t actually every used). Some of the methods have been developed quite recently.\nAnonymous Feedback As someone who is constantly learning and growing in many ways, I welcome your feedback about the course, the classroom dynamics, or anything else you’d like me to know. There is a link to an anonymous feedback form on the landing page of our Sakai webpage. Please provide me with feedback at any time!\nTexts:\nAll resources are freely available. They also all have print versions which can be purchased. Using the online version of the books is expected.\nFirst section of the course (data science, data viz, wrangling, simulating, permutation tests, bootstrapping, ethics)\n\nContent: Modern Data Science with R; Baumer, Kaplan, and Horton, https://mdsr-book.github.io/mdsr2e/\nR resource: R for Data Science, Wickham, https://r4ds.had.co.nz/\nRecommended: Visual and Statistical Thinking: Displays of Evidence for Making Decisions; Tufte http://www.edwardtufte.com/tufte/books_textb\n\nSecond section of the course (bootstrapping, knn, trees, bagging, random forests, support vector machines, clustering)\n\nContent: An Introduction to Statistical Learning; James, Witten, Hastie, and Tibshirani https://www.statlearning.com/\nR resource: Tidy Modeling with R; Kuhn and Silge https://www.tmwr.org/\n\nImportant Dates:\n\n10/14 + 15/21 Exam 1 (not during class)\n10/22/21 Take home 1 due (on GitHub + Gradescope by midnight)\n10/26/21 Initial Project Proposal due (via email to me by midnight)\n11/2/21 Final Project Proposal due (on GitHub by midnight)\n(TBD mid-November) 2021 Data Science Panel\n11/19/21 Project Update due (on GitHub by midnight)\n11/30/21 Take home 2 due (on GitHub by midnight)\n12/2 + 3/21 Exam 2 (not during class)\n12/10/21 (Friday) or 12/14/21 (Tuesday) Group Presentations (2-5pm)\n12/14/21 Final write-up due (on GitHub by midnight)\n\nLinks to resources:\nGit resources\n\nBest and most comprehensive Git help: http://happygitwithr.com/\nVersion control with Git\nMore on Git\nOnline Git book with lots of info\n\nR resources\n\ninteractive tutorials for working through “R for Data Science”\nfor a good start to R in general\nA fantastic ggplot2 tutorial\nGreat tutorials through the Coding Club\nGoogle for R\nsome R ideas that I wrote up\nIncredibly helpful cheatsheets from RStudio.\ndata wrangling\nggplot2\nR Markdown\nRStudio IDE\n\n\nHomework:\n\nHomework will be assigned from the text(s) with some additional problems. One homework grade will be dropped. Homework will be done using the statistical software package R (in the RStudio IDE) and posted to GitHub + Gradescope. All homework must be done in RMarkdown and compiled to pdf.\nHomework will be due on Thursdays by 11:59pm to GitHub + Gradescope.\nNon-homework activities (e.g., from the text) may be collected and added to your participation grade.\nHW should be turned in to your GitHub repository and posted to Gradescope by Thursday at 11:59pm.\nAlways post both a PDF and R Markdown file to GitHub (and a pdf to Gradescope), unless otherwise requested.\nHW is graded on a scale of 5/4/3/2/1. See the first HW assignment for more information.\nHW file should be in the format of: ma154-hw#-lname-fname.pdf\nHW format\nplease be neat and organized which will help me, the grader, and you (in the future) to follow your work.\nwrite your name on your assignment.\nplease include at least the number of the problem, or a summary of the question (which will also be helpful to you in the future to prepare for exams).\nit is strongly recommended that you look through the questions as soon as you get the assignment. This will help you to start thinking how to solve them!\nfor R problems, it is required to use R Markdown * in case of questions, or if you get stuck please don’t hesitate to email me (though I’m much less sympathetic to such questions if I receive emails within 24 hours of the due date for the assignment).\nHW Grading\nHomework assignments will be graded out of 5 points, which are based on a combination of accuracy and effort. Below are rough guidelines for grading.\n[5] All problems completed with detailed solutions provided and 75% or more of the problems are fully correct. Additionally, there are no extraneous messages, warnings, or printed lists of numbers.\n[4] All problems completed with detailed solutions and 50-75% correct; OR close to all problems completed and 75%-100% correct. Or all problems are completed and there are extraneous messages, warnings, or printed lists of numbers.\n[3] Close to all problems completed with less than 75% correct.\n[2] More than half but fewer than all problems completed and > 75% correct.\n[1] More than half but fewer than all problems completed and < 75% correct; OR less than half of problems completed.\n[0] No work submitted, OR half or less than half of the problems submitted and without any detail/work shown to explain the solutions. You will get a zero if your file is not compiled and submitted on GitHub.\n\nProjects:\nThere will be a semester long group project. Your task is to use data to tell us something interesting. This project is deliberately open-ended to allow you to fully explore your creativity. There are three main rules that must be followed: (1) data centered, (2) tell us something, (3) do something new. The project information is available here: Math 154 Semester Project\nComputing:\nGitHub will be used as a way to practice reproducible and collaborative science. There may be a slight learning curve, but knowing Git will be an extremely useful skill as you venture on after this class.\nR will be used for all homework assignments. R is freely available at http://www.r-project.org/ and is already installed on college computers. Additionally, you need to install R Studio in order to use R Markdown, http://rstudio.org/. If you are not already familiar with R, please work through some of the materials provided ASAP.\nYou are welcome to use Pomona’s R Studio server at https://rstudio.campus.pomona.edu/ (or https://rstudio.pomona.edu if you are off campus). If you use the server, you can connect directly to your Git account without installing Git locally on your own computer. [If you are not a Pomona student, you will need to get an account from Pomona’s ITS. Go to ITS, tell them that you are taking a Pomona course, and ask for an account for using RStudio.]\nParticipation:\nThis class will be interactive, and your participation is expected (every day in class). Although notes will be posted, your participation is an integral part of the in-class learning process.\nIn class: after answering one question, wait until 5 other people have spoken before answering another question. [Feel free to ask as many questions as often as you like!]\nCourse Goals:\n\nto be able to work through the entire computational statistics flow chart as a data analyst.\nto be able to use graphical representations of data to communicate ideas about the data.\nto be able to identify, understand, and describe the uses and misuses of algorithms and data collection from an ethical lens with the purpose of preventing harms from data science.\nto critically evaluate analyses / graphics of data (typically big data or dynamic data).\nto communicate results effectively.\n\nAcademic Honesty:\nYou are on your honor to present only your work as part of your course assessments. Below, I’ve provided Pomona’s academic honesty policy. But before the policy, I’ve given some thoughts on cheating which I have taken from Nick Ball’s CHEM 147 Collective (thank you, Prof Ball!). Prof Ball gives us all something to think about when we are learning in a classroom as well as on our journey to become scientists and professionals:\nThere are many known reasons why we may feel the need to “cheat” on problem sets or exams:\n\nAn academic environment that values grades above learning.\nFinancial aid is critical for remaining in school that places undue pressure on maintaining a high GPA.\nNavigating school, work, and/or family obligations that have diverted focus from class.\nChallenges balancing coursework and mental health.\nBalancing academic, family, peer, or personal issues.\n\nBeing accused of cheating – whether it has occurred or not – can be devastating for students. The college requires me to respond to potential academic dishonesty with a process that is very long and damaging. As your instructor, I care about you and want to offer alternatives to prevent us from having to go through this process. If you find yourself in a situation where “cheating” seems like the only option:\nPlease come talk to me. We will figure this out together.\nPomona College is an academic community, all of whose members are expected to abide by ethical standards both in their conduct and in their exercise of responsibilities toward other members of the community. The college expects students to understand and adhere to basic standards of honesty and academic integrity. These standards include, but are not limited to, the following:\n\nIn projects and assignments prepared independently, students never represent the ideas or the language of others as their own.\nStudents do not destroy or alter either the work of other students or the educational resources and materials of the College.\nStudents neither give nor receive assistance in examinations.\nStudents do not take unfair advantage of fellow students by representing work completed for one course as original work for another or by deliberately disregarding course rules and regulations.\nIn laboratory or research projects involving the collection of data, students accurately report data observed and do not alter these data for any reason.\n\nAdvice:\nPlease email and / or set up a time to talk if you have any questions about or difficulty with the material, the computing, or the course. Talk to me as soon as possible if you find yourself struggling. The material will build on itself, so it will be much easier to catch up if the concepts get clarified earlier rather than later. This semester is going to be fun. Let’s do it.\nGrading:\n\n25% Homework\n45% Midterms\n25% Group Project & Presentation\n5% Class Participation\n\n\n\n\n",
    "preview": "posts/2021-08-24-syllabus/../../images/debugging.jpg",
    "last_modified": "2021-08-24T08:08:55-07:00",
    "input_file": {}
  }
]
